#+title:     Exercises in SICP Chapter 3
#+author:    Jason Huang
#+email:     huangmianrui0310@outlook.com
#+date:      <2021-04-08 Thu>

#+description:  Exercises and solutions in SICP chapter 3
#+keywords:     sicp, exercises, solutions, lisp, scheme
#+language:     en
#+startup:      content
#+exclude_tags: noexport

*** Solution

#+name: make-accumulator-procedure
#+begin_src scheme
(define (make-accumulator acc)
  (lambda (num)
    (set! acc (+ acc num))
    acc))
#+end_src

#+name: test-solution-3-1
#+begin_src scheme
<<make-accumulator-procedure>>

(define A (make-accumulator 5))
(display (A 10)) (newline)
(display (A 10)) (newline)
#+end_src

#+RESULTS: test-solution-3-1
: 15
: 25

*** Solution

#+name: make-monitored-procedure
#+begin_src scheme
(define (make-monitored f)
  (let ((count 0))
    (define (mf . args)
      (if (= (length args) 1)
          (let ((arg (car args)))
            (cond ((eq? arg 'how-many-calls?) count)
                  ((eq? arg 'reset-count) (set! count 0))
                  (else (set! count (+ count 1))
                        (f arg))))
          (error "bad arguments: " args)))
    mf))
#+end_src

#+name: test-solution-3-2
#+begin_src scheme
<<make-monitored-procedure>>

(define s (make-monitored sqrt))
(display (s 100)) (newline)
(display (s 'how-many-calls?)) (newline)
(display (s 'reset-count)) (newline)
(display (s 'how-many-calls?)) (newline)
#+end_src

#+RESULTS: test-solution-3-2
: 10
: 1
: #<void>
: 0

*** Solution

#+name: password-protected-account-procedure
#+begin_src scheme
(define (make-account balance secret)
  (define (withdraw amount)
    (if (>= balance amount)
        (begin (set! balance (- balance amount))
               balance)
        "Insufficient funds"))
  (define (deposit amount)
    (set! balance (+ balance amount))
    balance)
  (define (dispatch m)
    (cond ((eq? m 'withdraw) withdraw)
          ((eq? m 'deposit) deposit)
          (else (error "Unknown request: MAKE-ACCOUNT"
                       m))))
  (define (warning n) "Incorrect password")
  (lambda (password message)
    (if (eq? password secret) (dispatch message) warning)))
#+end_src

#+name: test-solution-3-3
#+begin_src scheme
<<password-protected-account-procedure>>

(define acc (make-account 100 'secret-password))
(display ((acc 'secret-password 'withdraw) 40)) (newline)
(display ((acc 'some-other-password 'deposit) 50))
#+end_src

#+RESULTS: test-solution-3-3
: 60
: Incorrect password

*** Solution

#+name: make-account-procedure-counting-incorrect-password
#+begin_src scheme
(define (make-account balance secret)
  (define (withdraw amount)
    (if (>= balance amount)
        (begin (set! balance (- balance amount))
               balance)
        "Insufficient funds"))
  (define (deposit amount)
    (set! balance (+ balance amount))
    balance)
  (define (dispatch m)
    (cond ((eq? m 'withdraw) withdraw)
          ((eq? m 'deposit) deposit)
          (else (error "Unknown request: MAKE-ACCOUNT"
                       m))))
  (define (warning n) "Incorrect password")
  (define (call-the-cops n) "You're wanted!!!")
  (let ((incorrect 0))
    (lambda (password message)
      (cond ((eq? password secret)
             (set! incorrect 0) (dispatch message))
            ((< incorrect 7)
             (set! incorrect (+ incorrect 1)) warning)
            (else call-the-cops)))))
#+end_src

#+name: test-solution-3-4
#+begin_src scheme
<<make-account-procedure-counting-incorrect-password>>

(define acc (make-account 100 'secret-password))
(printf "~a~n" ((acc 'wrong-password-1 'withdraw) 10))
(printf "~a~n" ((acc 'wrong-password-2 'withdraw) 10))
(printf "~a~n" ((acc 'wrong-password-3 'withdraw) 10))
(printf "~a~n" ((acc 'wrong-password-4 'withdraw) 10))
(printf "~a~n" ((acc 'wrong-password-5 'withdraw) 10))
(printf "~a~n" ((acc 'wrong-password-6 'withdraw) 10))
(printf "~a~n" ((acc 'wrong-password-7 'withdraw) 10))
(printf "~a~n" ((acc 'wrong-password-8 'withdraw) 10))
#+end_src

#+RESULTS: test-solution-3-4
: Incorrect password
: Incorrect password
: Incorrect password
: Incorrect password
: Incorrect password
: Incorrect password
: Incorrect password
: You're wanted!!!

*** Solution

#+name: monte-carlo-procedure
#+begin_src scheme
(define (monte-carlo trials experiment)
  (define (iter trials-remaining trials-passed)
    (cond ((= trials-remaining 0)
           (/ trials-passed trials))
          ((experiment)
           (iter (- trials-remaining 1)
                 (+ trials-passed 1)))
          (else
           (iter (- trials-remaining 1)
                 trials-passed))))
  (iter trials 0))
#+end_src

#+name: estimate-integral-procedure
#+begin_src scheme
(define (estimate-integral P x1 x2 y1 y2 trials)
  (define (experiment) (P (random-in-range x1 x2) (random-in-range y1 y2)))
  (monte-carlo trials experiment))
#+end_src

#+name: test-solution-3-5
#+begin_src scheme
<<monte-carlo-procedure>>
<<random-in-range-procedure>>
<<estimate-integral-procedure>>

(define (in-circle-predicate cx cy radius)
  (lambda (x y)
    (<= (+ (expt (- x cx) 2)
           (expt (- y cy) 2))
        (expt radius 2))))
(define P (in-circle-predicate 5.0 7.0 3.0))
(define in-unit-circle (in-circle-predicate 0.0 0.0 1.0))
(display (* (estimate-integral P 2.0 8.0 4.0 10.0 10000) 36.0)) (newline)
(display (* (estimate-integral in-unit-circle -1.0 1.0 -1.0 1.0 10000) 4.0))
#+end_src

#+RESULTS: test-solution-3-5
: 28.5228
: 3.1584

*** Solution

#+name: rand-procedure-with-reset
#+begin_src scheme
(define (rand-update x)
  ;; ref: https://en.wikipedia.org/wiki/Linear_congruential_generator
  (let ((a 1103515245)
        (b 12345)
        (m (expt 2 31)))
    (modulo (+ (* a x) b) m)))
(define random-init (rand-update 65536))
(define rand
  (let ((seed random-init))
    (lambda (m)
      (cond ((eq? m 'generate)
             (set! seed (rand-update seed)) seed)
            ((eq? m 'reset)
             (lambda (new-seed) (set! seed (rand-update new-seed))))
            (else (error "Unknown request: RAND" m))))))
#+end_src

#+name: test-solution-3-6
#+begin_src scheme
<<rand-procedure-with-reset>>

(display (rand 'generate)) (newline)
(display (rand 'generate)) (newline)
((rand 'reset) 65536)
(display (rand 'generate)) (newline)
(display (rand 'generate)) (newline)
#+end_src

#+RESULTS: test-solution-3-6
: 1850021502
: 1673078751
: 1850021502
: 1673078751

*** Solution

#+name: make-joint-procedure
#+begin_src scheme
(define (make-joint account orig-pwd joint-pwd)
  (lambda (password message)
    (if (eq? password joint-pwd)
        (account orig-pwd message)
        (error "Incorrect password"))))
#+end_src

#+name: test-solution-3-7
#+begin_src scheme
<<password-protected-account-procedure>>
<<make-joint-procedure>>

(define peter-acc (make-account 100 'open-sesame))
(define paul-acc
  (make-joint peter-acc 'open-sesame 'rosehub))
(display ((paul-acc 'rosehub 'withdraw) 10)) (newline)
(display ((peter-acc 'open-sesame 'withdraw) 0))
#+end_src

#+RESULTS: test-solution-3-7
: 90
: 90

*** Solution

#+name: f-procedure
#+begin_src scheme
(define f
  (let ((memory 1))
    (lambda (n)
      (set! memory (* memory n))
      memory)))
#+end_src

#+name: test-solution-3-8-1
#+begin_src scheme
<<f-procedure>>

(display (+ (f 0) (f 1))) (newline)
#+end_src

#+RESULTS: test-solution-3-8-1
: 0

#+name: test-solution-3-8-2
#+begin_src scheme
<<f-procedure>>

(display (+ (f 1) (f 0))) (newline)
#+end_src

#+RESULTS: test-solution-3-8-2
: 1

*** Solution

#+name: test-solution-3-12-1
#+begin_src scheme
(define x (list 'a 'b))
(define y (list 'c 'd))
(define z (append x y))
(display z) (newline)
(display (cdr x))
#+end_src

#+RESULTS: test-solution-3-12-1
: (a b c d)
: (b)

#+begin_example
    +---+---+  +---+---+        +---+---+  +---+---+
x ->| * | *-+->| * | / |    y ->| * | *-+->| * | / |
    +-+-+---+  +-+-+---+        +-+-+---+  +-+-+---+
      |          |                |          |
      V          V                V          V
    +---+      +---+            +---+      +---+
    | a |      | b |            | c |      | d |
    +---+      +---+            +---+      +---+

    +---+---+  +---+---+  +---+---+  +---+---+
z ->| * | *-+->| * | *-+->| * | *-+->| * | / |
    +-+-+---+  +-+-+---+  +-+-+---+  +-+-+---+
      |          |          |          |
      V          V          V          V
    +---+      +---+      +---+      +---+
    | a |      | b |      | c |      | d |
    +---+      +---+      +---+      +---+
#+end_example

#+name: test-solution-3-12-2
#+begin_src scheme
<<append-mutator-procedure>>
<<last-pair-procedure>>
(define x (list 'a 'b))
(define y (list 'c 'd))
(define w (append! x y))
(display w) (newline)
(display (cdr x))
#+end_src

#+RESULTS: test-solution-3-12-2
: (a b c d)
: (b c d)

#+begin_example
    +---+---+  +---+---+        +---+---+  +---+---+
x ->| * | *-+->| * | / |    y ->| * | *-+->| * | / |
    +-+-+---+  +-+-+---+        +-+-+---+  +-+-+---+
      |          |                |          |
      V          V                V          V
    +---+      +---+            +---+      +---+
    | a |      | b |            | c |      | d |
    +---+      +---+            +---+      +---+

      x                     y
      |                     |
      V                     V
    +---+---+  +---+---+  +---+---+  +---+---+
w ->| * | *-+->| * | *-+->| * | *-+->| * | / |
    +-+-+---+  +-+-+---+  +-+-+---+  +-+-+---+
      |          |          |          |
      V          V          V          V
    +---+      +---+      +---+      +---+
    | a |      | b |      | c |      | d |
    +---+      +---+      +---+      +---+
#+end_example

*** Solution

#+begin_src scheme
<<count-pairs-procedure>>
(printf "~a~n" (count-pairs '(1 (2 3))))
(printf "~a~n" (count-pairs '(1 2 3)))
(define x '(1))
(define y (cons x x))
(printf "~a~n" (count-pairs (list x x)))
(printf "~a~n" (count-pairs (cons y y)))
#+end_src

#+RESULTS:
: 4
: 3
: 4
: 7

#+begin_example
     +---+---+  +---+---+  +---+---+       +---+---+
x3 ->| * | *-+->| * | *-+->| * | / |  x7 ->| * | * |
     +-+-+---+  +-+-+---+  +-+-+---+       +-+-+-+-+
       |          |          |               |   |
       v          v          v               vv--+
     +---+      +---+      +---+           +---+---+
     | 1 |      | 2 |      | 3 |           | * | * |
     +---+      +---+      +---+           +-+-+-+-+
                                             |   |
     +---+---+  +---+---+                    vv--+
x4 ->| * | *-+->| * | / |                  +---+---+
     +-+-+---+  +-+-+---+                  | * | / |
       |          |                        +-+-+---+
       v----------+                          |
     +---+---+                               v
     | * | / |                             +---+
     +-+-+---+                             | 1 |
       |                                   +---+
       v
     +---+
     | 1 |
     +---+

       +-----------------------------+
       v                             |
     +---+---+  +---+---+  +---+---+ |
inf->| * | *-+->| * | *-+->| * | *-+-+
     +-+-+---+  +-+-+---+  +-+-+---+
       |          |          |
       v          v          v
     +---+      +---+      +---+
     | 1 |      | 2 |      | 3 |
     +---+      +---+      +---+
#+end_example

*** Solution

#+name: make-queue-procedure-with-local-state
#+begin_src scheme
(define (make-queue)
  (let ((front-ptr '())
        (rear-ptr '()))
    (define (empty-queue?) (null? front-ptr))
    (define (set-front-ptr! item) (set! front-ptr item))
    (define (set-rear-ptr! item) (set! rear-ptr item))
    (define (front-queue)
      (if (null? front-ptr)
          (error "FRONT called with an empty queue" queue)
          (car front-ptr)))
    (define (insert-queue! item)
      (let ((new-item (list item)))
        (set-front-ptr! (append front-ptr new-item))
        (set-rear-ptr! new-item)
        dispatch))
    (define (delete-queue!)
      (if (null? front-ptr)
          (error "DELETE! called with an empty queue" queue)
          (begin (set-front-ptr! (cdr front-ptr))
                 dispatch)))
    (define (dispatch m)
      (cond ((eq? m 'empty-queue?) (empty-queue?))
            ((eq? m 'front-queue) front-queue)
            ((eq? m 'insert-queue!) insert-queue!)
            ((eq? m 'delete-queue!) (delete-queue!))
            ((eq? m 'print-queue) (printf "~a~n" front-ptr))
            (else (error "Undefined operation: " m))))
    dispatch))
(define (empty-queue? queue) (queue 'empty-queue?))
(define (front-queue queue) (queue 'front-queue))
(define (insert-queue! queue item) ((queue 'insert-queue!) item))
(define (delete-queue! queue) (queue 'delete-queue!))
(define (print-queue queue) (queue 'print-queue))
#+end_src

#+name: test-solution-3-22
#+begin_src scheme
<<make-queue-procedure-with-local-state>>
(define q1 (make-queue))
(insert-queue! q1 'a)
(print-queue q1)
(insert-queue! q1 'b)
(print-queue q1)
(delete-queue! q1)
(print-queue q1)
(delete-queue! q1)
(print-queue q1)
#+end_src

#+RESULTS: test-solution-3-22
: (a)
: (a b)
: (b)
: ()

*** Solution

#+name: table-with-arbitrary-keys
#+begin_src scheme
(define (make-table)
  (define local-table (list '*table*))

  (define (assoc key records)
    (cond ((null? records) false)
          ((equal? key (caar records)) (car records))
          (else (assoc key (cdr records)))))

  (define (lookup keys)
    (let ((record (assoc keys (cdr local-table))))
      (if record
          (cdr record)
          false)))

  (define (insert! keys value)
    (let ((record (assoc keys (cdr local-table))))
      (if record
          (set-cdr! record value)
          (set-cdr! local-table (cons (cons keys value) (cdr local-table))))))

  (define (dispatch m)
    (cond ((eq? m 'lookup) lookup)
          ((eq? m 'insert!) insert!)
          ((eq? m 'print) (printf "~a~n" local-table))
          (else (error "Unknown operation -- TABLE" m))))
  dispatch)
(define (insert! table value . keys)
  ((table 'insert!) keys value))
(define (lookup table . keys)
  ((table 'lookup) keys))
(define (print-table table) (table 'print))
#+end_src

#+name: test-solution-3-25
#+begin_src scheme
(require r5rs)
<<table-with-arbitrary-keys>>

(define t (make-table))
(insert! t 1 'a 'b)
(print-table t)
(printf "~a~n" (lookup t 'a 'b))
(insert! t 2 'a)
(print-table t)
(insert! t 3 'a 'b 'c 'd)
(print-table t)
(printf "~a~n" (lookup t 'a 'b 'c 'd))
(printf "~a~n" (lookup t 'a 'b 'c))
#+end_src

#+RESULTS: test-solution-3-25
: {*table* {{a b} . 1}}
: 1
: {*table* {{a} . 2} {{a b} . 1}}
: {*table* {{a b c d} . 3} {{a} . 2} {{a b} . 1}}
: 3
: #f

